//0. Демонстрация решения

//Напишите программу, которая 
//1.на вход принимает число
//2. и выдаёт его квадрат (число
//умноженное на само себя).
//3.вывод результата
//Например:
//4 -> 16
//-3 -> 9
//-7 -> 49

Console.Write("Введите целое число: ");

int number = Convert.ToInt32(Console.ReadLine());
int square = number * number;
Console.WriteLine($"Квадрат числа {number} = {square}");


bool b = number == square
if(number !=square && number > 10 && square < 10)
{
    
}